# 김진혁 2021-03-17
# DataTypes.py 
# 자료형

1. 숫자형
 - 정수형, 실수형(+지수 표현 방식) 
 - 8진수, 16진수
 - 사칙연산(+,-,*,/)
 - **(제곱 연산자)
 - //(몫 연산자)

2. 문자형
 - 문자열 사용 방법
  1) "문자열"
  2) '문자열'
  3) """문자열"""
  4) '''문자열'''
 - 문자열 더하기 
  ABC + DEF => ABCDEF
  ABC * 2 => ABCABC
 - 문자열길이 LEN(문자열) 
 - 인덱스는 0부터 시작, 뒤에서는 -1부터
 - 문자열 슬라이싱 str[0:4] str[1:] str[:3] str[:] str[5:-7]
 - 문자열중 문자1개를 바꿀수 없음, 슬라이싱으로 조합을 해야함
 - 문자열 포매팅 
   %d %s  => %(number, str)
   {0} => .format("str")
 - 문자 개수 세기 count()
 - 문자 위치 알려주기 find() index()
 - 문자열 삽입 join(str) 문자열 str사이에 구분자 삽입
 - 공백제거 lstrip() rstrip() strip()
 - 문자열 바꾸기 replace()

3. 리스트 자료형

 
 
 


